app/views/photos/index.html.erb

        <a href="<%= photo_path( photo ) %>">
          <%= image_tag( if photo.comments.count > 0 then "coment-active.png" else "coment-relaxed.png" end ) %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 2]]