app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("text", "photo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "lolasoo"], ["photo_id", 1], ["created_at", "2015-06-05 18:43:42.522722"], ["updated_at", "2015-06-05 18:43:42.522722"]]