app/controllers/photos_controller.rb

  def show
    @comments = @photo.comments.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."photo_id" = ?  [["photo_id", 1]]

  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save
---
INSERT INTO "photos" ("picture", "created_at", "updated_at") VALUES (?, ?, ?)  [["picture", "javascript_logo.png"], ["created_at", "2015-06-05 18:43:33.814127"], ["updated_at", "2015-06-05 18:43:33.814127"]]